app/controllers/chats_controller.rb

  def index
    @chats = Chat.all
---
SELECT "chats".* FROM "chats"

  def show
    @chat = Chat.find(params[:id])
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def load_users
    @users = User.all
---
SELECT "users".* FROM "users"