app/controllers/users_controller.rb

INSERT INTO "users" ("email", "first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "[FILTERED]"], ["first_name", "Matias"], ["last_name", "Garcia"], ["created_at", "2025-05-02 19:35:43.985912"], ["updated_at", "2025-05-02 19:35:43.985912"]]
---
  def create
    @user = User.new(user_params)
    if @user.save